Тестовая_база_ERP_14/src/Reports/РЭЙ_РеестрКонтрактовВЭД/РЭЙ_РеестрКонтрактовВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РЭЙ_РеестрКонтрактовВЭД</name>
  <attributes>
    <name>ВидКонтрактаВЭД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЗаголовка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчетаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитЗаем</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДвижения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Report>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_КонтрактыВЭД/РЭЙ_КонтрактыВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_КонтрактыВЭД</name>
  <attributes>
    <name>Автопролонгация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяОговорка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.РЭЙ_ВидыПодтверждающихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрактаВЭД</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыКонтрактовВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтартовойДатыОжидаемогоСрока</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыСтартовыхДатОжидаемогоСрока</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияОбязательствПоКонтракту</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставкиОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругиеМетодыОпределенияПроцентнойСтавки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инкотермс</name>
    <type>
      <types>CatalogRef.РЭЙ_Инкотермс</types>
    </type>
  </attributes>
  <attributes>
    <name>ИныеПлатежиПредусмотренныеКредитнымДоговором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПериодичностиФиксированныхПлатежей</name>
    <type>
      <types>EnumRef.РЭЙ_КодыПериодичностиФиксированныхПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДляВозвратаАвансаПоИмпортномуКонтракту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДополнительное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактБезСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактПредмет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактПредметАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактТоварный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитныйДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитныйСиндикат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныеФинОрганизации</name>
    <type>
      <types>EnumRef.РЭЙ_МеждународныеФинОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоДнейДляУведомленияОПрекращенииДействияКонтракта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Многосторонний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеДействует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяОбъектомВалютногоКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЗаполненияГрафикаПогашения</name>
    <comment>0 - Сведения из кредитного договора, 1 -  Оценочные данные</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежаПредоплаты</name>
    <type>
      <types>EnumRef.РЭЙ_ОтсрочкаПлатежаПредоплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаДопСоглашений</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСделки</name>
    <type>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодическиеФиксированныеПлатежи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодФиксированныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставлениеЗайма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПривлечениеКредитаЗайма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентныеПлатежиПоКредитамВЭД</name>
    <type>
      <types>EnumRef.РЭЙ_ПроцентныеПлатежиПоКредитамВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрямоеИнвестирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПереходаРисков</name>
    <type>
      <types>CatalogRef.РЭЙ_ПунктыПереходаРисков</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПроцентнойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенияВалКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РамочныйКонтракт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СправкиВКсНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокиПогашенияКредитовВЭД</name>
    <type>
      <types>EnumRef.РЭЙ_СрокиПогашенияКредитовВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЛИБОР</name>
    <type>
      <types>EnumRef.РЭЙ_СтавкаЛИБОР</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалВыручкиПодлежащаяЗачислениюНаСчетаВБанкеНерезиденте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОбеспечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПодлежащаяЗачислениюНаСчетаВБанкеНерезиденте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтавкаГодовыхПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Экспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БанковскиеСчета</name>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтороныПоКонтракту</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСоглашения</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемоеКоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемоеКоличествоДнейДополнительное</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Reports/РЭЙ_РеестрКонтрактовВЭД/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытий_Форма

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Организация = РЭЙ_Универсализация.ПолучитьОсновнуюОрганизацию();
	Отчет.Статус = "Все";
	
	ЗаполнитьДатуОтчета();
	
	УстановитьОтображение_НаправлениеДвижения();
	УстановитьОтображение_КредитЗаем();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЗаголовок(Команда)
	Элементы.ВыводитьЗаголовок.Пометка = Не Элементы.ВыводитьЗаголовок.Пометка;
	ВыводЗаголовка();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетаПриИзменении(Элемент)
	Отчет.ДатаОтчетаВручную = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Отчет.ДатаОтчетаВручную = Ложь;
	ЗаполнитьДатуОтчета();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ОтобразитьСостояниеНесформированногоОтчета();
КонецПроцедуры

&НаКлиенте
Процедура СтатусОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Отчет.Статус = "Все";
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ОтобразитьСостояниеНесформированногоОтчета();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОтобразитьСостояниеНесформированногоОтчета();
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтрактаВЭДПриИзменении(Элемент)
	ВидКонтрактаВЭДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидКонтрактаВЭДПриИзмененииНаСервере()
	ОтобразитьСостояниеНесформированногоОтчета();
	
	Если Отчет.ВидКонтрактаВЭД <> "Контракт" Тогда
		Отчет.НаправлениеДвижения = "";
	КонецЕсли;
	Если Отчет.ВидКонтрактаВЭД <> "Кредитный договор" Тогда
		Отчет.КредитЗаем = "";
	КонецЕсли;
	
	УстановитьОтображение_НаправлениеДвижения();
	УстановитьОтображение_КредитЗаем();
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеДвиженияПриИзменении(Элемент)
	ОтобразитьСостояниеНесформированногоОтчета();
КонецПроцедуры

&НаКлиенте
Процедура КредитЗаемПриИзменении(Элемент)
	ОтобразитьСостояниеНесформированногоОтчета();
КонецПроцедуры

#КонецОбласти

#Область Отображение

&НаСервере
Процедура УстановитьОтображение_НаправлениеДвижения()
	Если Отчет.ВидКонтрактаВЭД = "Контракт" Тогда
		Элементы.НаправлениеДвижения.Видимость = Истина;
	Иначе
		Элементы.НаправлениеДвижения.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображение_КредитЗаем()
	Если Отчет.ВидКонтрактаВЭД = "Кредитный договор" Тогда
		Элементы.КредитЗаем.Видимость = Истина;
	Иначе
		Элементы.КредитЗаем.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДатуОтчета()
	Если Не Отчет.ДатаОтчетаВручную Тогда
		Отчет.ДатаОтчета = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеНесформированногоОтчета()
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.Результат.ОтображениеСостояния.Видимость = Истина;
	Отчет.ВысотаЗаголовка = 0;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображение_СправкаВалютногоКонтроля()
	Если Отчет.ВидСправкиВалютногоКонтроля <> "СВО+СПД" Тогда
		Элементы.СправкаВалютногоКонтроля.Видимость = Истина;
	Иначе
		Элементы.СправкаВалютногоКонтроля.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ВыводЗаголовка()
	Если Отчет.ВысотаЗаголовка <> 0 Тогда
		Результат.Область(1,, Отчет.ВысотаЗаголовка).Видимость = Элементы.ВыводитьЗаголовок.Пометка;		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеОтчета

&НаСервере
Процедура СформироватьОтчетНаСервере()
	ЗаполнитьДатуОтчета();
	
	Результат.Очистить();
	
	Макет = Отчеты.РЭЙ_РеестрКонтрактовВЭД.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ДатаОтчета = Формат(?(ЗначениеЗаполнено(Отчет.ДатаОтчета), Отчет.ДатаОтчета, ТекущаяДата()), "ДФ='dd.MM.yyyy HH:mm:ss'");
	Область.Параметры.Организация = ?(ЗначениеЗаполнено(Отчет.Организация), Отчет.Организация, "Все");
	Область.Параметры.Контрагент = ?(ЗначениеЗаполнено(Отчет.Контрагент), Отчет.Контрагент, "Все");
	Область.Параметры.ВидКонтрактаВЭД = ?(ЗначениеЗаполнено(Отчет.ВидКонтрактаВЭД), Отчет.ВидКонтрактаВЭД, "Все");
	Область.Параметры.НаправлениеДвижения = ?(ЗначениеЗаполнено(Отчет.НаправлениеДвижения), Отчет.НаправлениеДвижения, "Все");
	Область.Параметры.КредитЗаем = ?(ЗначениеЗаполнено(Отчет.КредитЗаем), Отчет.КредитЗаем, "Все");
	Область.Параметры.Статус = Отчет.Статус;
	Результат.Вывести(Область);
	Отчет.ВысотаЗаголовка = Результат.ВысотаТаблицы;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РЭЙ_КонтрактыВЭД.Ссылка КАК КонтрактВЭД,
	|	РЭЙ_КонтрактыВЭД.Контрагент КАК Контрагент,
	|	РЭЙ_КонтрактыВЭД.КонтрактПредмет КАК Предмет,
	|	РЭЙ_КонтрактыВЭД.ВидКонтрактаВЭД КАК ВидКонтрактаВЭД,
	|	РЭЙ_КонтрактыВЭД.КонтрактСумма КАК Сумма,
	|	РЭЙ_КонтрактыВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаЦены,
	|	ВЫБОР
	|		КОГДА ЛОЖЬ
	|			ТОГДА ВалютаРегламентированногоУчета.Значение
	|		ИНАЧЕ РЭЙ_КонтрактыВЭД.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК ВалютаПлатежа,
	|	РЭЙ_КонтрактыВЭД.КонтрактДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА РЭЙ_КонтрактыВЭД.НеДействует
	|			ТОГДА ""Закрыт""
	|		ИНАЧЕ ""Действ.""
	|	КОНЕЦ КАК Статус
	|ИЗ
	|	Справочник.РЭЙ_КонтрактыВЭД КАК РЭЙ_КонтрактыВЭД,
	|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета";
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Если ЗначениеЗаполнено(Отчет.Организация) Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.Организация = &Организация");
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Контрагент) Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.Контрагент = &Контрагент");
	КонецЕсли;
	//Вид контракта ВЭД
	Если Отчет.ВидКонтрактаВЭД = "Контракт" Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.КредитныйДоговор = ЛОЖЬ");
	КонецЕсли;
	Если Отчет.ВидКонтрактаВЭД = "Кредитный договор" Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.КредитныйДоговор");
	КонецЕсли;
	//Направление движения
	Если Отчет.НаправлениеДвижения = "Импорт" Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.Импорт");
	КонецЕсли;
	Если Отчет.НаправлениеДвижения = "Экспорт" Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.Экспорт");
	КонецЕсли;
	// Кредит/заем
	Если Отчет.КредитЗаем = "Полученный" Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.ПривлечениеКредитаЗайма");
	КонецЕсли;
	Если Отчет.КредитЗаем = "Выданный" Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.ПредоставлениеЗайма");
	КонецЕсли;
	// Статус
	Если Отчет.Статус = "Действующие" Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.НеДействует = ЛОЖЬ");
	КонецЕсли;
	Если Отчет.Статус = "Закрытые" Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("РЭЙ_КонтрактыВЭД.НеДействует");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Запрос.УстановитьПараметр("Контрагент", Отчет.Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Результат.Вывести(Область);
	Результат.ФиксацияСверху = Результат.ВысотаТаблицы;
	
	НомерСтроки = 0;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(Выборка);
		Область.Параметры.НомерСтроки = НомерСтроки;
		
		ПаспортСделки = РЭЙ_СлужебныйСервер.ПолучитьПаспортСделкиПоКонтрактуВЭД(Выборка.КонтрактВЭД);
		Область.Параметры.НомерПС = ПаспортСделки.НомерПаспортаСделки;
		
		Область.Параметры.ВидКонтракта = Сред(Строка(Выборка.ВидКонтрактаВЭД), 1, 1);
		
		БанковскийСчет = РЭЙ_СлужебныйСервер.ПолучитьБанковскийСчетПоКонтрактуВЭД(Выборка.КонтрактВЭД);
		Область.Параметры.НомерСчета = БанковскийСчет.НомерСчета;
		Область.Параметры.СвифтБИК = БанковскийСчет.Банк.РЭЙ_СвифтБИК;
		
		Область.Параметры.Сумма = ?(Выборка.Сумма = 0, "БС", Формат(Выборка.Сумма, "ЧДЦ=2"));
		
		Результат.Вывести(Область);
	КонецЦикла;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	ВыводЗаголовка();
	
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти
